КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ТипИсполненияЭкспСвоихОбязательст/КонтурЛогистика_ТипИсполненияЭкспСвоихОбязательст.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ТипИсполненияЭкспСвоихОбязательст</name>
  <enumValues>
    <name>_1</name>
  </enumValues>
  <enumValues>
    <name>_2</name>
  </enumValues>
  <enumValues>
    <name>_3</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ТипИсполненияЭкспСвоихОбязательст/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция Сериализовать(Знач Значение) Экспорт
    
    Если Значение = _1 Тогда
        Возврат "1";
    ИначеЕсли Значение = _2 Тогда
        Возврат "2";
    ИначеЕсли Значение = _3 Тогда
        Возврат "3";
    Иначе
    	Возврат "1";    
    КонецЕсли;
    
 КонецФункции
 
Функция Десериализовать(Знач Значение) Экспорт
    
	Если Значение = "1" Тогда
		Возврат _1;
	ИначеЕсли Значение = "2" Тогда
		Возврат _2;
	ИначеЕсли Значение = "3" Тогда
		Возврат _3;
	Иначе
        Возврат ПустаяСсылка();
    КонецЕсли;
    
КонецФункции 

#КонецЕсли
